# Redis
###What is Redis?
* it stands for REmote DIctionary Server.
* a key/value store
* NoSQL database
* retrieves data based on a key
* Redis is an in-memory but persistent on disk database, so it represents a different trade off where very high write and read speed is achieved with the limitation of data sets that can't be larger than memory.

###How to use it?
```bash
> SET server:name "fido"
> GET server:name
"fido"
```

###What else?
```bash
> SET connections 10
> INCR connections
(integer) 11
> INCR connections
(integer) 12
> DEL connections
(integer) 1
> SET name "fido"
> SETNX name "larry"
> GET name
"fido"
```

* `SETNX` means set if not exist
* `INC` increments the value. it is an ATOMIC operation to ensure that two users do not change the count concurrently
(Atomicity prevent partial updates to the database ie: both pay for and reserve a seat OR neither pay for nor reserve a seat. You can never pay for a seat you cannot reserve.. unless you are purchasing an airline ticket)

```bash
> SET resource:lock "Redis Demo"
> EXPIRE resource:lock 120
```
causes the key `resource:lock` to be deleted in 120 seconds
use `TTL resource:lock` to determine how long until the resource is deleted

# Datastructures
##List
A list is a series of ordered values

```bash
> RPUSH friends "Tom"
(integer) 1
> LPUSH friends "Bob"
(integer) 2
> LRANGE friends 0 -1
1) "Bob"
2) "Tom"
> LLEN friends
(integer) 2
> RPOP friends
"Tom"
> LLEN friends
(integer) 1
```

## Set
Does not have a specific order, and each element must be unique

```bash
> SADD superpowers "flight"
(integer) 1
> SADD superpowers "x-ray vision"
(integer) 1
> SADD superpowers "reflexes"
(integer) 1
> SADD superpowers "reflexes"
(integer) 0
> SREM superpowers "flight"
"1"
```
That last command removes an item

```bash
> SISMEMBER superpowers "flight"
(integer) 0
> SISMEMBER superpowers "reflexes"
(integer) 1
> SMEMBERS superpowers
1) "reflexes"
2) "x-ray vision"
> SADD birdpowers "pecking"
(integer) 1
> SADD birdpowers "flight"
(integer) 1
> SUNION superpowers birdpowers
1) "flight"
2) "reflexes"
3) "x-ray vision"
4) "pecking"
```

## Sorted Set
```bash
> ZADD hackers 1940 "Alan Kay"
(integer) 1
> ZADD hackers 1953 "Richard Stallman"
(integer) 1
> ZADD hackers 1965 "Yukihiro Matsumoto"
(integer) 1
> ZADD hackers 1916 "Claude Shannon"
(integer) 1
> ZRANGE hackers 0 -1
1) "Claude Shannon"
2) "Alan Kay"
3) "Richard Stallman"
4) "Yukihiro Matsumoto"
```
